ambiot/ambd_sdk/component/soc/realtek/amebad/verification/usb_otg/rtl8721d_usbd_test.c
#include "usb.h"
#include "usb_composite.h"
#include "rand.h"
#include "rtl8721d_usbd_test.h"

static struct usb_verify_device_t usbd_test_dev;
static u8 *GoldenData;
static u32 data_count = 0;
static _sema wait_equeue_sema; 

/*
*To Compare out and in data
*/
BOOL UsbdDataCompare(u8 *pSrc, u8 *pDst, u32 Length)
{
	int Index;
	
	for (Index = 0; Index < Length; ++Index){
		if(pSrc[Index] != pDst[Index]) {
			DBG_8195A("Src/Dst data[%d] = %x/%x\n", Index, pSrc[Index], pDst[Index]);
			if(Index != 0)
				DBG_8195A("Src/Dst data[%d] = %x/%x\n", Index-1, pSrc[Index-1], pDst[Index-1]);
			return _FALSE;
		}
	}
	return _TRUE;
}

/*
*To Generate Tx Data
*Mode:
	USBD_DATA_SEQ: fixed
	USBD_DATA_SEQ: sequential 
	USBD_DATA_RND: random
*/
void UsbdDataGenerate(u8 *pTxArray, u32 Length, u32 Mode)
{
	u32 i  = 0;
	_memset(pTxArray, 0x0, Length);

	switch (Mode)
	{
		case USBD_DATA_FIX:
			for(i = 0; i < Length; i++)
				pTxArray[i] = 0x3E;
			break;
		case USBD_DATA_SEQ:
			for(i = 0; i < Length; i++)
				pTxArray[i] = i & 0xFF;
			break;
		case USBD_DATA_RND:
			for(i = 0; i < Length; i++)
				pTxArray[i] =  Rand() & 0xFF;
			break;
		default:
			break;
	}
}

static void UsbdVerifyFreeRequest(struct usb_ep *ep, struct usb_request *req)
{
	if ((ep != NULL) && (req != NULL)) {
		if (req->buf != NULL) {
			rtw_free(req->buf);
			req->buf = NULL;
		}

		usb_ep_free_request(ep, req);
	}
}

static void usbd_verify_ctrl_out_complete(struct usb_ep *ep, struct usb_request *req)
{
	UNUSED(ep);
	u8 *mem = (u8 *)req->buf;
	
	if ((req->status == USB_ESUCCESS) && (req->actual == 2)) {
		DBG_8195A("Ep status(self-power, remote-wakeup): %d, %d\n", mem[0], mem[1]);
	}
}

void UsbdVerifyCtrl(const struct usb_control_request *ctrl)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	struct usb_ep *ep0 = vdev->ep0;
	struct usb_request  *req0 = vdev->req0;
	int status;

	if (USB_GET_TYPE(ctrl->bmRequestType) == USB_TYPE_VENDOR &&
	(ctrl->bRequest == 0) && (ctrl->wValue == 0x0100) && (ctrl->wLength == 2)) {
		req0->complete = usbd_verify_ctrl_out_complete;
		req0->length = ctrl->wLength;
		req0->zero = 0;
	}

	status = usb_ep_queue(ep0, req0, 1);
	if (status != 0 && status != -USB_ESHUTDOWN) {
		DBG_8195A("Fail to queue EP0 request: %d\n", status);
	}

	return status;
}

static void usbd_verify_bulk_in_complete(struct usb_ep *ep, struct usb_request *req)
{
	int status = req->status;
	int ret = 0;
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	
        /*check request status*/
	switch (status) {
		case USB_ESUCCESS: 			/* tx successfuly*/
			if((vdev->test_mode == 1) && vdev->long_run_flag) {
				ret = usb_ep_queue(ep, req, 1);
				if (ret) {
					DBG_8195A("Fail to enqueue bulk in request\n");
				}
			}
			break;
		/* FALLTHROUGH */
		case -USB_ECONNRESET:		/* unlink */
			DBG_8195A("ECONNRESET status = %d\n", status);
		case -USB_ESHUTDOWN:		/* disconnect etc */
			DBG_8195A("ESHUTDOWN status = %d\n", status);
			break;
		default:
			DBG_8195A("in_complete ERROR(%d)\n", status);
	}
}

static void usbd_verify_bulk_out_complete(struct usb_ep *ep, struct usb_request *req)
{
	int ret;
	int status = req->status;
	struct usb_verify_device_t *vdev = &usbd_test_dev;

	switch (status) {
		case USB_ESUCCESS:
			if(vdev->test_mode == 3) {	//loopback
				rtw_memset(vdev->bulk_in_buf, 0, vdev->bulk_buf_size);
				rtw_memcpy(vdev->bulk_in_buf, req->buf, req->actual);
				vdev->bulk_in_req->length = req->actual;
				ret = usb_ep_queue(vdev->bulk_in_ep, vdev->bulk_in_req, 1);
				if (ret < 0) {
					DBG_8195A("Fail to queue bulk in request\n");
				}
			} else {		//only receive
				if(UsbdDataCompare(GoldenData, (u8 *)req->buf, req->length)) {
					if(vdev->long_run_flag) {
						if(data_count == 5000) {
							data_count = 0;
							DBG_8195A("Success\n");
						}
						data_count ++;
					} else {
						DBG_8195A("Bulk out data success\n");
						break;
					}
				} else {
					DBG_8195A("Bulk out data fail\n");
					break;
				}
			}

			rtw_memset(vdev->bulk_out_buf, 0, vdev->bulk_buf_size);
			ret = usb_ep_queue(ep, req, 1);
			if (ret){
				DBG_8195A("Fail to queue bulk out request\n");
			}

			break;

		case -USB_ESHUTDOWN:
			DBG_8195A("Bulk out shutdown\n");
			break;

		default:
			DBG_8195A("Bulk out failed: %d\n", status);
			break;
		}
}

void UsbdVerifyBulk(void)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	struct usb_request  *req;
	int status = 0;

	if((vdev->test_mode & 0x2) == 2) {
		// BULK OUT
		if (vdev->bulk_out_ep != NULL) {
			GoldenData  = rtw_zmalloc(vdev->bulk_buf_size);
			if (!GoldenData) {
				DBG_8195A("Fail to allocate golden data buffer\n");
				goto exit;
			}
			UsbdDataGenerate(GoldenData, vdev->bulk_buf_size, USBD_DATA_SEQ);
			
			if (vdev->bulk_out_ep->driver_data != NULL) {
				usb_ep_disable(vdev->bulk_out_ep);
				vdev->bulk_out_ep->driver_data = NULL;
			}

			if (vdev->bulk_out_req != NULL) {
				UsbdVerifyFreeRequest(vdev->bulk_out_ep, vdev->bulk_out_req);
				vdev->bulk_out_req = NULL;
			}

			vdev->bulk_out_ep->desc = usb_get_descriptor(vdev->gadget, &verify_bulk_out_ep_HS, &verify_bulk_out_ep_FS);

			status = usb_ep_enable(vdev->bulk_out_ep, vdev->bulk_out_ep->desc);
			if (status < 0) {
				DBG_8195A("Fail to enable bulk out endpoint: %d\n", status);
				goto exit;
			}

			vdev->bulk_out_ep->driver_data = vdev;

			req = usb_ep_alloc_request(vdev->bulk_out_ep, 1);
			if (!req) {
				DBG_8195A("Fail to allocate bulk out request\n");
				goto exit;
			}

			vdev->bulk_out_buf = rtw_zmalloc(vdev->bulk_buf_size);
			if (vdev->bulk_out_buf == NULL) {
				DBG_8195A("Fail to allocate bulk out data buffer\n");
				goto exit;
			}

			vdev->bulk_out_req= req;
			req->buf = vdev->bulk_out_buf;
			req->dma = (dma_addr_t)req->buf;
			req->length = vdev->bulk_buf_size;
			req->complete = usbd_verify_bulk_out_complete;
			req->context = vdev;

			status = usb_ep_queue(vdev->bulk_out_ep, req, 1);
			if (status) {
				DBG_8195A("Fail to enqueue bulk out request\n");
				goto exit;
			}
		}
	}

	if((vdev->test_mode & 0x1) == 1) {
		// BULK IN
		if (vdev->bulk_in_ep != NULL) {
			if (vdev->bulk_in_ep->driver_data != NULL) {
				usb_ep_disable(vdev->bulk_in_ep);
				vdev->bulk_in_ep->driver_data = NULL;
			}

			if (vdev->bulk_in_req != NULL) {
				UsbdVerifyFreeRequest(vdev->bulk_in_ep, vdev->bulk_in_req);
				vdev->bulk_in_req = NULL;
			}

			vdev->bulk_in_ep->desc = usb_get_descriptor(vdev->gadget, &verify_bulk_in_ep_HS, &verify_bulk_in_ep_FS);

			status = usb_ep_enable(vdev->bulk_in_ep, vdev->bulk_in_ep->desc);
			if (status < 0) {
				DBG_8195A("Fail to enable bulk IN endpoint: %d\n", status);
				goto exit;
			}

