ambiot/ambd_sdk/component/soc/realtek/amebad/verification/usb_otg/rtl8721d_usbd_test.c
			vdev->bulk_in_ep->driver_data = vdev;

			req = usb_ep_alloc_request(vdev->bulk_in_ep, 1);
			if (!req) {
				DBG_8195A("Fail to allocate bulk in request\n");
				goto exit;
			}

			vdev->bulk_in_buf = rtw_zmalloc(vdev->bulk_buf_size);
			if (vdev->bulk_in_buf == NULL) {
				DBG_8195A("Fail to allocate bulk in data buffer\n");
				goto exit;
			}

			 UsbdDataGenerate(vdev->bulk_in_buf , vdev->bulk_buf_size, USBD_DATA_SEQ);

			vdev->bulk_in_req= req;
			req->buf = vdev->bulk_in_buf;
			req->length = vdev->bulk_buf_size;
			req->dma = (dma_addr_t)req->buf;
			req->complete = usbd_verify_bulk_in_complete;
			req->context = vdev;
		}
		
		if(vdev->test_mode == 1) {
			status = usb_ep_queue(vdev->bulk_in_ep, req, 1);
			if (status) {
				DBG_8195A("Fail to enqueue bulk in request\n");
				goto exit;
			}
		}
	}
	return;

exit:
	if(vdev->bulk_out_buf)
		rtw_free(vdev->bulk_out_buf);
	if(vdev->bulk_out_ep && vdev->bulk_out_req)
		usb_ep_free_request(vdev->bulk_out_ep, vdev->bulk_out_req);
	if(vdev->bulk_in_buf)
		rtw_free(vdev->bulk_in_buf);
	if(vdev->bulk_out_ep && vdev->bulk_in_req)
		usb_ep_free_request(vdev->bulk_in_ep, vdev->bulk_in_req);
}

static void usbd_verify_iso_in_complete(struct usb_ep *ep, struct usb_iso_request *req)
{
	int status = req->status;

	UNUSED(ep);

	/*check request status*/
	switch (status) {
		case USB_ESUCCESS:             /* tx successfuly*/
			break;

		/* FALLTHROUGH */
		case -USB_ECONNRESET:   /* unlink */
			DBG_8195A("ECONNRESET\n");
			break;

		case -USB_ESHUTDOWN:    /* disconnect etc */
			DBG_8195A("ESHUTDOWN\n");
			break;

		default:
			DBG_8195A("ISO complete with error: %d\n", status);
	}
}

static void usbd_verify_iso_out_complete(struct usb_ep *ep, struct usb_iso_request *req)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	u8 *buf;
	u32 len;
	UNUSED(ep);

	if (req->proc_buf_num == 0) {
		buf = (u8 *)(req->buf0);
		len = req->data_per_frame;
	} else {
		buf = (u8 *)(req->buf1);
		len = req->data_per_frame1;
	}
	
	if(UsbdDataCompare(GoldenData, buf, len)) {
		if(vdev->long_run_flag) {
			rtw_memset(buf, 0, len);
			if(data_count == 5000) {
				data_count = 0;
				DBG_8195A("Success\n");
			}
			data_count ++;
		} else
			DBG_8195A("Iso out data success\n");
	} else {
		DBG_8195A("Iso out data fail\n");
	}
}

void UsbdVerifyIsoIn(void)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	struct usb_iso_request  *isoinreq;
	struct usb_iso_request  *isooutreq;
	int status = 0;
	int i;

	if (vdev->iso_in_ep != NULL) {
		for (i = 0; i < 2; i++) {
			vdev->iso_in_req_buf[i] = (u8 *)rtw_zmalloc(vdev->iso_buf_size);
			if (!vdev->iso_in_req_buf[i]) {
				DBG_8195A("Fail to allocate iso in request buffer\n");
				goto exit;
			}
			UsbdDataGenerate(vdev->iso_in_req_buf[i], vdev->iso_buf_size, USBD_DATA_SEQ);
		}
		
		if (vdev->iso_in_ep->driver_data != NULL) {
			iso_ep_stop(vdev->iso_in_ep, vdev->iso_in_req);	
			usb_ep_disable(vdev->iso_in_ep);
			vdev->iso_in_ep->driver_data = NULL;
		}

		if (vdev->iso_in_req != NULL) {
			free_iso_request(vdev->iso_in_ep, vdev->iso_in_req);
			vdev->iso_in_req = NULL;
		}

		vdev->iso_in_ep->desc = usb_get_descriptor(vdev->gadget, &verify_iso_in_ep_HS, &verify_iso_in_ep_FS);

		status = usb_ep_enable(vdev->iso_in_ep, vdev->iso_in_ep->desc);
		if (status < 0) {
			DBG_8195A("Fail to enable iso in endpoint: %d\n", status);
			goto exit;
		}

		vdev->iso_in_ep->driver_data = vdev;

		isoinreq = alloc_iso_request(vdev->iso_in_ep, 1, 1);
		if (!isoinreq) {
			DBG_8195A("Fail to allocate iso in request\n");
			goto exit;
		}

		isoinreq->buf0 = vdev->iso_in_req_buf[0];
		isoinreq->buf1 = vdev->iso_in_req_buf[1];
		isoinreq->dma0 = (dma_addr_t)isoinreq->buf0;
		isoinreq->dma1 = (dma_addr_t)isoinreq->buf1;
		isoinreq->buf_proc_intrvl = (1 << (vdev->iso_in_ep->desc->bInterval - 1));
		isoinreq->zero = 0;
		isoinreq->sync_frame = 0;
		isoinreq->data_pattern_frame = 0;
		isoinreq->data_per_frame = vdev->iso_buf_size;
		isoinreq->data_per_frame1 = vdev->iso_buf_size;
		isoinreq->start_frame = 0;
		isoinreq->flags |= USB_REQ_ISO_ASAP;
		isoinreq->proc_buf_num = 0;
		isoinreq->process_buffer = usbd_verify_iso_in_complete;
		isoinreq->context = vdev;

		vdev->iso_in_req = isoinreq;

		iso_ep_start(vdev->iso_in_ep, vdev->iso_in_req, 1);
	}
	
	return;
	
exit:
	for (i = 0; i < 2; i++) {
		if(vdev->iso_in_req_buf[i])
			rtw_free(vdev->iso_in_req_buf[i]);
	}
	if(vdev->iso_in_ep && vdev->iso_in_req)
		free_iso_request(vdev->iso_in_ep, vdev->iso_in_req);
}

void UsbdVerifyIsoOut(void)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	struct usb_iso_request  *isoinreq;
	struct usb_iso_request  *isooutreq;
	int status = 0;
	int i;

	if (vdev->iso_out_ep != NULL) {
		GoldenData  = rtw_zmalloc(vdev->iso_buf_size);
		if (!GoldenData) {
			DBG_8195A("Fail to allocate golden data buffer\n");
			goto exit;
		}
		UsbdDataGenerate(GoldenData, vdev->iso_buf_size, USBD_DATA_SEQ);
		
		for (i = 0; i < 2; i++) {
			vdev->iso_out_req_buf[i] = (u8 *)rtw_zmalloc(vdev->iso_buf_size);
			if (!vdev->iso_out_req_buf[i]) {
				DBG_8195A("Fail to allocate iso out request buffer\n");
				goto exit;
			}
		}
		
		if (vdev->iso_out_ep->driver_data != NULL) {
			iso_ep_stop(vdev->iso_out_ep, vdev->iso_out_req);	
			usb_ep_disable(vdev->iso_out_ep);
			vdev->iso_out_ep->driver_data = NULL;
		}

		if (vdev->iso_out_req != NULL) {
			free_iso_request(vdev->iso_out_ep, vdev->iso_out_req);
			vdev->iso_out_req = NULL;
		}

		vdev->iso_out_ep->desc = usb_get_descriptor(vdev->gadget, &verify_iso_out_ep_HS, &verify_iso_out_ep_FS);

		status = usb_ep_enable(vdev->iso_out_ep, vdev->iso_out_ep->desc);
		if (status < 0) {
			DBG_8195A("Fail to enable iso out endpoint: %d\n", status);
			goto exit;
		}

		vdev->iso_out_ep->driver_data = vdev;

		isooutreq = alloc_iso_request(vdev->iso_out_ep, 1, 1);
		if (!isooutreq) {
			DBG_8195A("Fail to allocate iso out request\n");
			goto exit;
		}

		isooutreq->buf0 = vdev->iso_out_req_buf[0];
		isooutreq->buf1 = vdev->iso_out_req_buf[1];
		isooutreq->dma0 = (dma_addr_t)isooutreq->buf0;
		isooutreq->dma1 = (dma_addr_t)isooutreq->buf1;
		isooutreq->buf_proc_intrvl = (1 << (vdev->iso_out_ep->desc->bInterval - 1));
		isooutreq->zero = 0;
		isooutreq->sync_frame = 0;
		isooutreq->data_pattern_frame = 0;
		isooutreq->data_per_frame = vdev->iso_buf_size;
		isooutreq->data_per_frame1 = vdev->iso_buf_size;
		isooutreq->start_frame = 0;
		isooutreq->flags |= USB_REQ_ISO_ASAP;
		isooutreq->proc_buf_num = 0;
		isooutreq->process_buffer = usbd_verify_iso_out_complete;
		isooutreq->context = vdev;

