ambiot/ambd_sdk/component/soc/realtek/amebad/verification/usb_otg/rtl8721d_usbd_test.c
		vdev->iso_out_req = isooutreq;

		iso_ep_start(vdev->iso_out_ep, vdev->iso_out_req, 1);
	}
	
	return;
	
exit:
	for (i = 0; i < 2; i++) {
		if(vdev->iso_out_req_buf[i])
			rtw_free(vdev->iso_out_req_buf[i]);
	}
	if(vdev->iso_out_ep && vdev->iso_out_req)
		free_iso_request(vdev->iso_out_ep, vdev->iso_out_req);
}

static void usbd_verify_int_in_complete(struct usb_ep *ep, struct usb_request *req)
{
	int status = req->status;
	int ret = 0;
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	
        /*check request status*/
	switch (status) {
		case USB_ESUCCESS: 			/* tx successfuly*/
			if((vdev->test_mode == 1) && vdev->long_run_flag) {
				ret = usb_ep_queue(ep, req, 1);
				if (ret) {
					DBG_8195A("Fail to enqueue interrupt in request\n");
				}
			}
			break;
		/* FALLTHROUGH */
		case -USB_ECONNRESET:		/* unlink */
			DBG_8195A("ECONNRESET status = %d\n", status);
		case -USB_ESHUTDOWN:		/* disconnect etc */
			DBG_8195A("ESHUTDOWN status = %d\n", status);
			break;
		default:
			DBG_8195A("in_complete ERROR(%d)\n", status);
	}
}

static void usbd_verify_int_out_complete(struct usb_ep *ep, struct usb_request *req)
{
	int ret;
	int status = req->status;
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	UNUSED(ep);

	switch (status) {
		case USB_ESUCCESS:
			if(vdev->test_mode == 3) {	//loopback
				rtw_memcpy(vdev->int_in_buf, req->buf, req->actual);
				vdev->int_in_req->length = req->actual;
				ret = usb_ep_queue(vdev->int_in_ep, vdev->int_in_req, 1);
				if (ret < 0) {
					DBG_8195A("Fail to queue interrupt in request\n");
				}
			} else {		//only receive
				if(UsbdDataCompare(GoldenData, (u8 *)req->buf, req->length)) {
					if(vdev->long_run_flag) {
						if(data_count == 5000) {
							data_count = 0;
							DBG_8195A("Success\n");
						}
						data_count ++;
					} else {
						DBG_8195A("Success\n");
						break;
					}
				} else {
					DBG_8195A("Interrupt out data fail\n");
					break;
				}
			}

			rtw_memset(vdev->int_out_buf, 0, vdev->int_buf_size);
			ret = usb_ep_queue(ep, req, 1);
			if (ret){
				DBG_8195A("Fail to queue interrupt out request\n");
			}

			break;

		case -USB_ESHUTDOWN:
			DBG_8195A("Interrupt out shutdown\n");
			break;

		default:
			DBG_8195A("Interrupt out failed: %d\n", status);
			break;
		}
}

void UsbdVerifyInt(void)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	struct usb_request  *req;
	int status = 0;

	if((vdev->test_mode & 0x2) == 2) {
		// INT OUT
		GoldenData  = rtw_zmalloc(vdev->int_buf_size);
		if (!GoldenData) {
			DBG_8195A("Fail to allocate golden data buffer\n");
			goto exit;
		}
		UsbdDataGenerate(GoldenData, vdev->int_buf_size, USBD_DATA_SEQ);
		
		if (vdev->int_out_ep->driver_data != NULL) {
			usb_ep_disable(vdev->int_out_ep);
			vdev->int_out_ep->driver_data = NULL;
		}

		if (vdev->int_out_req != NULL) {
			UsbdVerifyFreeRequest(vdev->int_out_ep, vdev->int_out_req);
			vdev->int_out_req = NULL;
		}

		vdev->int_out_ep->desc = usb_get_descriptor(vdev->gadget, &verify_int_out_ep_HS, &verify_int_out_ep_FS);

		status = usb_ep_enable(vdev->int_out_ep, vdev->int_out_ep->desc);
		if (status < 0) {
			DBG_8195A("Fail to enable interrupt out endpoint: %d\n", status);
			goto exit;
		}

		vdev->int_out_ep->driver_data = vdev;

		req = usb_ep_alloc_request(vdev->int_out_ep, 1);
		if (!req) {
			DBG_8195A("Fail to allocate interrupt out request\n");
			goto exit;
		}

		vdev->int_out_buf = rtw_zmalloc(vdev->int_buf_size);
		if (vdev->int_out_buf == NULL) {
			DBG_8195A("Fail to allocate interrupt out data buffer\n");
			goto exit;
		}

		vdev->int_out_req= req;
		req->buf = vdev->int_out_buf;
		req->dma = (dma_addr_t)req->buf;
		req->length = vdev->int_buf_size;
		req->complete = usbd_verify_int_out_complete;
		req->context = vdev;

		status = usb_ep_queue(vdev->int_out_ep, req, 1);
		if (status) {
			DBG_8195A("Fail to enqueue interrupt out request\n");
			goto exit;
		}
	}

	if((vdev->test_mode & 0x1) == 1) {
		// Int IN
		if (vdev->int_in_ep != NULL) {
			if (vdev->int_in_ep->driver_data != NULL) {
				usb_ep_disable(vdev->int_in_ep);
				vdev->int_in_ep->driver_data = NULL;
			}

			if (vdev->int_in_req != NULL) {
				UsbdVerifyFreeRequest(vdev->int_in_ep, vdev->int_in_req);
				vdev->int_in_req = NULL;
			}

			vdev->int_in_ep->desc = usb_get_descriptor(vdev->gadget, &verify_int_in_ep_HS, &verify_int_in_ep_FS);

			status = usb_ep_enable(vdev->int_in_ep, vdev->int_in_ep->desc);
			if (status < 0) {
				DBG_8195A("Fail to enable interrupt in endpoint: %d\n", status);
				goto exit;
			}

			vdev->int_in_ep->driver_data = vdev;

			req = usb_ep_alloc_request(vdev->int_in_ep, 1);
			if (!req) {
				DBG_8195A("Fail to allocate interrupt in request\n");
				goto exit;
			}

			vdev->int_in_buf = rtw_zmalloc(vdev->int_buf_size);
			if (vdev->int_in_buf == NULL) {
				DBG_8195A("Fail to allocate interrupt in data buffer\n");
				goto exit;
			}

			 UsbdDataGenerate(vdev->int_in_buf , vdev->int_buf_size, USBD_DATA_SEQ);

			vdev->int_in_req= req;
			req->buf = vdev->int_in_buf;
			req->length = vdev->int_buf_size;
			req->dma = (dma_addr_t)req->buf;
			req->complete = usbd_verify_int_in_complete;
			req->context = vdev;
		}

		if(vdev->test_mode == 1) {
			rtw_up_sema(&wait_equeue_sema);	
		}
	}
	return;

exit:
	if(vdev->int_out_buf)
		rtw_free(vdev->int_out_buf);
	if(vdev->int_out_ep && vdev->int_out_req)
		usb_ep_free_request(vdev->int_out_ep, vdev->int_out_req);
	if(vdev->int_in_buf)
		rtw_free(vdev->int_in_buf);
	if(vdev->int_out_ep && vdev->int_in_req)
		usb_ep_free_request(vdev->int_in_ep, vdev->int_in_req);
}

static int UsbdVerifySetAlt(struct usb_function *f, unsigned intf, unsigned alt)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;

	UNUSED(f);
	UNUSED(intf);
	UNUSED(alt);

	if(vdev->alt_cb)
		vdev->alt_cb();
}

static int UsbdVerifyBind(struct usb_configuration *c, struct usb_function *f)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	struct usb_ep *ep;
	int status = -USB_ENODEV;
	int id;

	/* allocate instance-specific interface IDs, and patch descriptors */
	id = usb_interface_id(c, f); // this will return the allocated interface id
	if (id < 0) {
		status = id;
		goto verify_fun_bind_exit;
	}

	verify_intf_desc.bInterfaceNumber = id;

	ep = usb_ep_autoconfig(c->cdev->gadget, &verify_bulk_in_ep_FS);
	if (!ep) {
		goto verify_fun_bind_exit;
	}

	ep->driver_data = vdev;
	vdev->bulk_in_ep = ep;

