ambiot/ambd_sdk/component/soc/realtek/amebad/verification/usb_otg/rtl8721d_usbd_test.c
	ep = usb_ep_autoconfig(c->cdev->gadget, &verify_bulk_out_ep_FS);
	if (!ep) {
		goto verify_fun_bind_exit;
	}

	ep->driver_data = vdev;
	vdev->bulk_out_ep = ep;

	verify_bulk_in_ep_HS.bEndpointAddress = verify_bulk_in_ep_FS.bEndpointAddress;
	verify_bulk_out_ep_HS.bEndpointAddress = verify_bulk_out_ep_FS.bEndpointAddress;
	
	DBG_8195A("BULK EP address in=0x%02x out=0x%02x\n", verify_bulk_in_ep_HS.bEndpointAddress,
	verify_bulk_out_ep_HS.bEndpointAddress);
	
#if USBD_ISO_VERIFY
	ep = usb_ep_autoconfig(c->cdev->gadget, &verify_iso_in_ep_FS);
	if (!ep) {
		goto verify_fun_bind_exit;
	}

	ep->driver_data = vdev;
	vdev->iso_in_ep = ep;

	ep = usb_ep_autoconfig(c->cdev->gadget, &verify_iso_out_ep_FS);
	if (!ep) {
		goto verify_fun_bind_exit;
	}

	ep->driver_data = vdev;
	vdev->iso_out_ep = ep;

	verify_iso_in_ep_HS.bEndpointAddress = verify_iso_in_ep_FS.bEndpointAddress;
	verify_iso_out_ep_HS.bEndpointAddress = verify_iso_out_ep_FS.bEndpointAddress;

	DBG_8195A("ISO EP address in=0x%02x out=0x%02x\n", verify_iso_in_ep_HS.bEndpointAddress,
	verify_iso_out_ep_HS.bEndpointAddress);
#else
	ep = usb_ep_autoconfig(c->cdev->gadget, &verify_int_in_ep_FS);
	if (!ep) {
		goto verify_fun_bind_exit;
	}

	ep->driver_data = vdev;
	vdev->int_in_ep = ep;

	ep = usb_ep_autoconfig(c->cdev->gadget, &verify_int_out_ep_FS);
	if (!ep) {
		goto verify_fun_bind_exit;
	}

	ep->driver_data = vdev;
	vdev->int_out_ep = ep;

	verify_int_in_ep_HS.bEndpointAddress = verify_int_in_ep_FS.bEndpointAddress;
	verify_int_out_ep_HS.bEndpointAddress = verify_int_out_ep_FS.bEndpointAddress;

	DBG_8195A("INT EP address in=0x%02x out=0x%02x\n", verify_int_in_ep_HS.bEndpointAddress,
	verify_int_out_ep_HS.bEndpointAddress);
#endif

	status = usb_assign_descriptors(f, verify_descriptors_FS, verify_descriptors_HS, NULL);
	if (status) {
		DBG_8195A("Fail to assign descriptors: %d\n", status);
		usb_free_all_descriptors(f);
		goto verify_fun_bind_exit;
	}

verify_fun_bind_exit:
	return status;
}

int UsbdVerifySetup(struct usb_function *f, const struct usb_control_request *ctrl)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;

	UNUSED(f);

	DBG_8195A("Setup request type=0x%02x request=0x%02x value=0x%04x index=0x%04x length=0x%04x\n",
	ctrl->bmRequestType, ctrl->bRequest, ctrl->wValue, ctrl->wIndex, ctrl->wLength);

	if(vdev->ctrl_cb)
		vdev->ctrl_cb(ctrl);
}

void UsbdVerifyDisable(struct usb_function *f)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	UNUSED(f);

	if (vdev->bulk_out_ep != NULL) {
		if (vdev->bulk_out_ep->driver_data != NULL) {
			usb_ep_disable(vdev->bulk_out_ep);
			vdev->bulk_out_ep->driver_data = NULL;
		}
	}

	if (vdev->bulk_in_ep != NULL) {
		if (vdev->bulk_in_ep->driver_data != NULL) {
			usb_ep_disable(vdev->bulk_in_ep);
			vdev->bulk_in_ep->driver_data = NULL;
		}
	}
	
	if (vdev->iso_out_ep != NULL) {
		if (vdev->iso_out_ep->driver_data != NULL) {
			iso_ep_stop(vdev->iso_out_ep, vdev->iso_out_req);
			usb_ep_disable(vdev->iso_out_ep);
			vdev->iso_out_ep->driver_data = NULL;
		}
	}

	if (vdev->iso_in_ep != NULL) {
		if (vdev->iso_in_ep->driver_data != NULL) {
			iso_ep_stop(vdev->iso_in_ep, vdev->iso_in_req);	
			usb_ep_disable(vdev->iso_in_ep);
			vdev->iso_in_ep->driver_data = NULL;
		}
	}

	if (vdev->int_out_ep != NULL) {
		if (vdev->int_out_ep->driver_data != NULL) {
			usb_ep_disable(vdev->int_out_ep);
			vdev->int_out_ep->driver_data = NULL;
		}
	}

	if (vdev->int_in_ep != NULL) {
		if (vdev->int_in_ep->driver_data != NULL) {
			usb_ep_disable(vdev->int_in_ep);
			vdev->int_in_ep->driver_data = NULL;
		}
	}
}

void UsbdVerifyUnbind(struct usb_configuration *c, struct usb_function *f)
{
	UNUSED(c);
	usb_free_all_descriptors(f);
}

static void UsbdVerifyFree(struct usb_function *f)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	int i;
	UNUSED(f);

	if (vdev->bulk_out_req != NULL) {
		UsbdVerifyFreeRequest(vdev->bulk_out_ep, vdev->bulk_out_req);
		vdev->bulk_out_req = NULL;
	}

	if (vdev->bulk_in_req != NULL) {
		UsbdVerifyFreeRequest(vdev->bulk_in_ep, vdev->bulk_in_req);
		vdev->bulk_in_req = NULL;
	}

	if (vdev->iso_out_req != NULL) {
		free_iso_request(vdev->iso_out_ep, vdev->iso_out_req);
		vdev->iso_out_req = NULL;
	}

	if (vdev->iso_in_req != NULL) {
		free_iso_request(vdev->iso_in_ep, vdev->iso_in_req);
		vdev->iso_in_req = NULL;
	}

	if (vdev->int_out_req != NULL) {
		UsbdVerifyFreeRequest(vdev->int_out_ep, vdev->int_out_req);
		vdev->int_out_req = NULL;
	}

	if (vdev->int_in_req != NULL) {
		UsbdVerifyFreeRequest(vdev->int_in_ep, vdev->int_in_req);
		vdev->int_in_req = NULL;
	}

	for (i = 0; i < 2; i++) {
		if(vdev->iso_in_req_buf[i]) {
			rtw_free(vdev->iso_in_req_buf[i]);
			vdev->iso_in_req_buf[i] = NULL;
		}
		
		if(vdev->iso_out_req_buf[i]) {
			rtw_free(vdev->iso_out_req_buf[i]);
			vdev->iso_out_req_buf[i] = NULL;
		}
	}

	usb_free_all_descriptors(f);   
}

static int UsbdVerifyConfig(struct usb_configuration *c)
{
	struct usb_verify_device_t *vdev = &usbd_test_dev;

	vdev->gadget = c->cdev->gadget;
	vdev->ep0 = c->cdev->gadget->ep0;
	vdev->req0 = c->cdev->req;

	return USB_ESUCCESS;
}

static struct usb_function verify_funcions = {
	.bind      = UsbdVerifyBind,
	.unbind    = UsbdVerifyUnbind,
	.setup     = UsbdVerifySetup,
	.set_alt   = UsbdVerifySetAlt,
	.disable   = UsbdVerifyDisable,
	.free_func = UsbdVerifyFree,
};

static struct usb_composite_driver verify_driver = {
	.dev_desc    = &verify_device_desc,
	.strings     = verify_gadget_strings,
	.config_desc = &verify_config_desc,
	.functions   = &verify_funcions,
	.driver_data = &usbd_test_dev,
	.config      = UsbdVerifyConfig,
};

int UsbdVerifyInit(void)
{
	int status = -USB_EINVAL;

	rtw_init_sema(&wait_equeue_sema, 0);

	status = usb_composite_register(&verify_driver);
	if (status != 0) {
		DBG_8195A("Fail to register composite driver");
		usb_composite_unregister(&verify_driver);
		goto usbd_verify_init_fail;
	}

