ambiot/ambd_sdk/component/soc/realtek/amebad/verification/usb_otg/rtl8721d_usbd_test.c
	return USB_ESUCCESS;

usbd_verify_init_fail:  
	rtw_free_sema(&wait_equeue_sema);
	return status;
}

void UsbdVerifyDeinit(void)
{
	rtw_free_sema(&wait_equeue_sema);
	usb_composite_unregister(&verify_driver);
}

static void usbd_wait_equeue_thread(void *param)
{  
	int status;
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	UNUSED(param);

	rtw_down_sema(&wait_equeue_sema);
	rtw_mdelay_os(50);
	
	status = usb_ep_queue(vdev->int_in_ep, vdev->int_in_req, 1);
	if (status) {
		DBG_8195A("Fail to enqueue interrupt in request\n");
	}
exit:
	rtw_thread_exit();
}

/*
	USBD   full/high   ctrl
	USBD   full/high   bulk  in/out/inout  transfer_size  long_run_flag
	USBD   full/high   iso  in/out  buf_size  long_run_flag
	USBD   full/high   int  in/out/inout  transfer_size  long_run_flag
*/
u32
CmdUsbdTest(
    IN  u16 argc,
    IN  u8  *argv[]
)
{
	int status;
	int speed;
	struct usb_verify_device_t *vdev = &usbd_test_dev;
	struct task_struct task;

	rtw_memset(vdev, 0, sizeof(struct usb_verify_device_t));

	if (strcmp(argv[0], "full") == 0) {
		speed = USB_SPEED_FULL;
	} else {
		speed = USB_SPEED_HIGH;
	}
	
	status = usb_init(speed);
	if (status != USB_INIT_OK) {
		DBG_8195A("\nFail to init USB device: %d\n", status);
		return _FALSE;
	}

	status = UsbdVerifyInit();
	if (status < 0) {
		DBG_8195A("\nFail to init USB device verify driver: %d\n", status);
		usb_deinit();
		return _FALSE;
	}
	
	if (strcmp(argv[1], "ctrl") == 0) {
		DBG_8195A("usb device control transfer test\n");
		vdev->ctrl_cb= UsbdVerifyCtrl;
	} else if (strcmp(argv[1], "bulk") == 0) {
		vdev->bulk_buf_size = _strtoul((const u8*)(argv[3]), (u8 **)NULL, 10);
		vdev->long_run_flag = _strtoul((const u8*)(argv[4]), (u8 **)NULL, 10);
		if(strcmp(argv[2], "in") == 0) {
			DBG_8195A("usb device bulk in transfer test\n");
			vdev->test_mode = 1;
		} else if(strcmp(argv[2], "out") == 0) {
			DBG_8195A("usb device bulk out transfer test\n");
			vdev->test_mode = 2;
		} else {
			DBG_8195A("usb device bulk inout transfer test\n");
			vdev->test_mode = 3;
		}
		vdev->alt_cb = UsbdVerifyBulk;
	} else if (strcmp(argv[1], "iso") == 0) {
	// macro USBD_ISO_VERIFY should set to 1
		vdev->iso_buf_size = _strtoul((const u8*)(argv[3]), (u8 **)NULL, 10);
		vdev->long_run_flag = _strtoul((const u8*)(argv[4]), (u8 **)NULL, 10);
		if(strcmp(argv[2], "in") == 0) {
			DBG_8195A("usb device iso in transfer test\n");
			vdev->alt_cb = UsbdVerifyIsoIn;
		} else {
			DBG_8195A("usb device iso out transfer test\n");
			vdev->alt_cb = UsbdVerifyIsoOut;
		}
	} else if (strcmp(argv[1], "int") == 0) {
	// macro USBD_ISO_VERIFY should set to 0
		vdev->int_buf_size = _strtoul((const u8*)(argv[3]), (u8 **)NULL, 10);
		vdev->long_run_flag = _strtoul((const u8*)(argv[4]), (u8 **)NULL, 10);
		if(strcmp(argv[2], "in") == 0) {
			DBG_8195A("usb device interrupt in transfer test\n");
			status = rtw_create_task(&task, "usbd_wait_equeue_thread", 1024, tskIDLE_PRIORITY + 2, usbd_wait_equeue_thread, NULL);
			if (status != pdPASS) {
				printf("\nFail to create USBD wait equeue thread\n");
				usb_deinit();
				return _FALSE;
			}
			vdev->test_mode = 1;
		} else if(strcmp(argv[2], "out") == 0) {
			DBG_8195A("usb device interrupt out transfer test\n");
			vdev->test_mode = 2;
		}  else {
			DBG_8195A("usb device interrupt inout transfer test\n");
			vdev->test_mode = 3;
		}
		vdev->alt_cb = UsbdVerifyInt;
	} else {
		DBG_8195A("%s: wrong cmd!!!\n", __FUNCTION__);
		return _FALSE;
	}

	return _TRUE;
}

CMD_TABLE_DATA_SECTION
const COMMAND_TABLE   usbd_test_cmd_table[] = {
	{(const u8*)"USBD",  1, CmdUsbdTest,      (const u8*)"\tUsb device \n"
	                                              "\t\t usb device test, input verification item \n"},
};
